In [1]:
import py_entitymatching as em

In [2]:
A = em.load_dataset('person_table_A', key='ID')
B = em.load_dataset('person_table_B', key='ID')

In [3]:
A.head()

,ID,name,birth_year,hourly_wage,address,zipcode
0,a1,Kevin Smith,1989,30.0,"607 From St, San Francisco",94107
1,a2,Michael Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
2,a3,William Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
3,a4,Binto George,1987,32.5,"423 Powell St, San Francisco",94122
4,a5,Alphonse Kemper,1984,35.0,"1702 Post Street, San Francisco",94122

In [4]:
B.head()

,ID,name,birth_year,hourly_wage,address,zipcode
0,b1,Mark Levene,1987,29.5,"108 Clement St, San Francisco",94107
1,b2,Bill Bridge,1986,32.0,"3131 Webster St, San Francisco",94107
2,b3,Mike Franklin,1988,27.5,"1652 Stockton St, San Francisco",94122
3,b4,Joseph Kuan,1982,26.0,"108 South Park, San Francisco",94122
4,b5,Alfons Kemper,1984,35.0,"170 Post St, Apt 4, San Francisco",94122

In [5]:
corres = em.get_attr_corres(A, B)

In [6]:
type(corres)

dict

In [8]:
corres['corres']

[('ID', 'ID'),
 ('name', 'name'),
 ('birth_year', 'birth_year'),
 ('hourly_wage', 'hourly_wage'),
 ('address', 'address'),
 ('zipcode', 'zipcode')]

In [11]:
ab = em.AttrEquivalenceBlocker()
C = ab.block_tables(A, B, 'birth_year', 'birth_year', l_output_attrs=['name'], r_output_attrs=['name'])

In [12]:
C.head()

   _id ltable_ID rtable_ID       ltable_name     rtable_name
0    0        a2        b3  Michael Franklin   Mike Franklin
1    1        a3        b2    William Bridge     Bill Bridge
2    2        a4        b1      Binto George     Mark Levene
3    3        a4        b6      Binto George  Michael Brodie
4    4        a5        b5   Alphonse Kemper   Alfons Kemper

In [13]:
D = em.sample_table(C, 4)

In [14]:
D

   _id ltable_ID rtable_ID       ltable_name     rtable_name
0    0        a2        b3  Michael Franklin   Mike Franklin
1    1        a3        b2    William Bridge     Bill Bridge
3    3        a4        b6      Binto George  Michael Brodie
4    4        a5        b5   Alphonse Kemper   Alfons Kemper

In [ ]:
G = em.label_table(D, label_column_name='label')

Column name (label) is not present in dataframe